import Modal from "./Modal";

function ModalContentOne() {
	return (
		<Modal
			moredetailed="Читать подробнее"
			description="Слово «whatever» может выполнять множество функций в английском языке, в зависимости от контекста, в котором оно используется. Вот некоторые из его значений:"
			description2="Безразличие или отсутствие конкретики: Может использоваться для
обозначения безразличия или отсутствия беспокойства по поводу выбора или
результата."
			example1="Пример: «We can watch whatever movie you choose»."
			description3="Подчеркивание любого варианта: Подчеркивает, что любой вариант в
определенной категории является приемлемым."
			example2="Пример: «You can take whatever book you like from the
    shelf»."
			description4="Отказ или пренебрежение: Может выражать пренебрежительное отношение или
указывать на то, что говорящий не заинтересован в дальнейшем обсуждении
темы."
			example3="Пример: «Whatever, I don’t care»."
			description5="Обобщение: Может использоваться для обобщения или отнесения к любым и
всем вещам в рамках определенной категории."
			example4="Пример: «Whatever happens, we’ll deal with it»."
			description6="Interrogative or Exclamatory: Может использоваться в вопросах или
восклицаниях, чтобы выразить удивление или замешательство."
			example5="Пример: «Whatever do you mean by that?»."
			description7="В целом, «whatever» – это универсальное слово,
которое может передавать различные отношения и значения в зависимости от
того, как оно используется в предложении."
		/>
	);
}
export default ModalContentOne;
